//数据结构模型： [{v: "省",b: [{v: "市",c: ["区"]}]},
var cn = [
{
    v: "北京",
    b: [{
        v: "北京市",
        c: ["小店区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"]
    }]
},
{
    v: "上海",
    b: [{
        v: "上海市",
        c: ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "宝山区", "闵行区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县", "川沙区"]
    }]
},
{
    v: "天津",
    b: [{
        v: "天津市",
        c: ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河县", "静海县", "蓟县"]
    }]
},
{
    v: "重庆",
    b: [{
        v: "重庆市",
        c: ["渝中区", "大渡口", "江北区", "沙坪坝", "九龙坡", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区万州区", "涪陵区", "黔江区", "长寿区", "江津区", "合川区", "永川区", "南川区綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "垫江县", "武隆县", "丰都县", "城口县", "梁平县", "开县", "巫溪县", "巫山县", "奉节县", "云阳县", "忠县", "石柱土家族自治县", "彭水苗族土家族自治县", "酉阳土家族苗族自治县", "秀山土家族苗族自治县"]
    }]
},
{
    v: "河北省",
    b: [{
        v: "石家庄市",
        c: ["长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "裕华区", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "井陉县", "正定县", "栾城县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县"]
    },
    {
        v: "唐山市",
        c: ["路北区", "路南区", "古冶区", "开平区", "丰南区", "丰润区", "遵化市", "迁安市", "滦　县", "滦南县", "乐亭县", "迁西县", "玉田县", "唐海县"]
    },
    {
        v: "秦皇岛市",
        c: ["海港区", "山海关区", "北戴河区", "昌黎县", "抚宁县", "卢龙县", "青龙满族自治县", "经济开发区"]
    },
    {
        v: "邯郸市",
        c: ["丛台区", "邯山区", "复兴区", "峰峰矿区", "武安市", "邯郸县", "临漳县", "成安县", "大名县", "涉县", "磁县", "肥乡县", "永年县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县"]
    },
    {
        v: "邢台市",
        c: ["桥东区", "桥西区", "南宫区", "沙河区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县"]
    },
    {
        v: "保定市",
        c: ["新市区", "北市区", "南市区", "涿州市", "定州市", "安国市", "高碑店市", "满城县", "清苑县", "涞水县", "阜平县", "徐水县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "高开区"]
    },
    {
        v: "张家口市",
        c: ["桥西区", "桥东区", "宣化区", "下花园区", "宣化县", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "万全县", "怀来县", "涿鹿县", "赤城县", "崇礼县"]
    },
    {
        v: "承德市",
        c: ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"]
    },
    {
        v: "沧州市",
        c: ["运河区", "新华区", "泊头区", "任丘区", "黄骅市", "河间市", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县", ]
    },
    {
        v: "廊坊市",
        c: ["安次区", "广阳区", "霸州市", "三河市", "固安县", "永清县", "香河县", "大城县", "文安县", "开发区", "燕郊经济技术开发区", "大厂回族自治县", ]
    },
    {
        v: "衡水市",
        c: ["桃城区", "冀州市", "深州市", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县"]
    }]
},
{
    v: "山西省",
    b: [{
        v: "太原市",
        c: ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市"]
    },
    {
        v: "大同市",
        c: ["城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县"]
    },
    {
        v: "阳泉市",
        c: ["城区", "矿区", "郊区", "平定县", "盂县"]
    },
    {
        v: "长治市",
        c: ["城区", "郊区", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县", "潞城市", "高新区"]
    },
    {
        v: "临汾市",
        c: ["尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市", "霍州市"]
    },
    {
        v: "晋中市",
        c: ["榆次区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太古县", "祁县", "平遥县", "灵石县", "介休市"]
    },
    {
        v: "运城市",
        c: ["盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市"]
    },
    {
        v: "晋城市",
        c: ["城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"]
    },
    {
        v: "忻州市",
        c: ["忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市", ]
    },
    {
        v: "朔州市",
        c: ["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁县"]
    },
    {
        v: "吕梁市",
        c: ["离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义县", "汾阳县"]
    }]
},
{
    v: "内蒙古自治区",
    b: [{
        v: "呼和浩特市",
        c: ["回民区", "新城区", "玉泉区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县", "清水河县", "武川县"]
    },
    {
        v: "包头市",
        c: ["昆都仑区", "东河区", "青山区", "石拐区", "白云矿区", "九原区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗"]
    },
    {
        v: "乌海市",
        c: ["海勃湾区", "海南区", "乌达区"]
    },
    {
        v: "赤峰市",
        c: ["红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗"]
    },
    {
        v: "通辽市",
        c: ["科尔沁区", "霍林郭勒市", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗"]
    },
    {
        v: "鄂尔多斯市",
        c: ["东胜区", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"]
    },
    {
        v: "呼伦贝尔市",
        c: ["海拉尔区", "满洲里市", "牙克石市", "扎兰屯市", "额尔古纳市", "根河市", "阿荣旗", "鄂伦春自治旗", "鄂温克族自治旗", "莫力达瓦达斡尔族", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗"]
    },
    {
        v: "巴彦淖尔市",
        c: ["临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"]
    },
    {
        v: "乌兰察布市",
        c: ["集宁区", "丰镇市", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗"]
    },
    {
        v: "兴安盟",
        c: ["乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县"]
    },
    {
        v: "锡林郭勒盟",
        c: ["二连浩特", "锡林浩特", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦"]
    },
    {
        v: "阿拉善盟",
        c: ["阿拉善左旗", "阿拉善右旗", "额济纳旗"]
    }]
},
{
    v: "辽宁省",
    b: [{
        v: "沈阳市",
        c: ["沈河区", "和平区", "大东区", "皇姑区", "铁西区", "苏家屯区", "东陵区", "沈北新区", "新城子区", "浑南新区", "张士开发区", "于洪区", "新民市", "辽中县", "康平县", "法库县"]
    },
    {
        v: "大连市",
        c: ["西岗区", "中山区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "瓦房店市", "开发区", "普兰店市", "庄河市", "岭前区", "长海县"]
    },
    {
        v: "鞍山市",
        c: ["铁东区", "铁西区", "立山区", "千山区", "海城市", "高新区", "台安县", "岫岩满族自治县"]
    },
    {
        v: "抚顺市",
        c: ["顺城区", "新抚区", "东洲区", "望花区", "抚顺县", "新宾满族自治县", "清原满族自治县"]
    },
    {
        v: "本溪市",
        c: ["平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "桓仁满族自治县"]
    },
    {
        v: "丹东市",
        c: ["振兴区", "元宝区", "振安区", "东港市", "凤城市", "宽甸满族自治县"]
    },
    {
        v: "锦州市",
        c: ["太和区", "古塔区", "凌河区", "凌海市", "北镇市", "黑山县", "义县"]
    },
    {
        v: "营口市",
        c: ["站前区", "西市区", "鲅鱼圈区", "老边区", "盖州市", "大石桥市"]
    },
    {
        v: "阜新市",
        c: ["海州区", "新邱区", "太平区", "清河门区", "细河区", "阜新蒙古族自治县", "彰武县"]
    },
    {
        v: "辽阳市",
        c: ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "灯塔市", "辽阳县"]
    },
    {
        v: "盘锦市",
        c: ["兴隆台区", "双台子区", "大洼县", "盘山县"]
    },
    {
        v: "铁岭市",
        c: ["银州区", "清河区", "调兵山市", "开原市", "铁岭县", "西丰县", "昌图县"]
    },
    {
        v: "朝阳市",
        c: ["双塔区", "龙城区", "北票市", "凌源市", "朝阳县", "建平县", "喀喇沁左翼蒙古族自治县"]
    },
    {
        v: "葫芦岛市",
        c: ["龙港区", "连山区", "南票区", "兴城市", "绥中县", "建昌县"]
    }]
},
{
    v: "吉林省",
    b: [{
        v: "长春市",
        c: ["朝阳区", "南关区", "宽城区", "二道区", "绿园区", "双阳区", "德惠市", "九台市", "榆树市", "农安县"]
    },
    {
        v: "吉林市",
        c: ["船营区", "昌邑区", "龙潭区", "丰满区", "蛟河市", "桦甸市", "舒兰市", "磐石市", "永吉县"]
    },
    {
        v: "四平市",
        c: ["铁西区", "铁东区", "公主岭市", "双辽市", "梨树县", "伊通满族自治县"]
    },
    {
        v: "辽源市",
        c: ["龙山区", "西安区", "东丰县", "东辽县"]
    },
    {
        v: "通化市",
        c: ["东昌区", "二道江区", "梅河口市", "集安市", "通化县", "辉南县", "柳河县"]
    },
    {
        v: "白山市",
        c: ["八道江区", "江源区", "临江市", "抚松县", "靖宇县", "长白朝鲜族自治县"]
    },
    {
        v: "松原市",
        c: ["宁江区", "长岭县", "乾安县", "扶余县", "前郭尔罗斯蒙古族自治县"]
    },
    {
        v: "白城市",
        c: ["洮北区", "洮南市", "大安市", "镇赉县", "通榆县"]
    },
    {
        v: "延边朝鲜族自治州",
        c: ["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "安图县"]
    }]
},
{
    v: "黑龙江省",
    b: [{
        v: "哈尔滨市",
        c: ["松北区", "道里区", "南岗区", "道外区", "平房区", "香坊区", "呼兰区", "阿城市", "双城市", "尚志市", "五常市", "依兰县", "方正县", "宾县县", "巴彦县", "木兰县", "通河县", "延寿县"]
    },
    {
        v: "齐齐哈尔市",
        c: ["龙沙区", "建华区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯区", "讷河市", "龙江县", "依安县", "泰来县", "甘南县", "富裕县", "克山县", "克东县", "拜泉县"]
    },
    {
        v: "鸡西市",
        c: ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "虎林市", "密山市", "鸡东县"]
    },
    {
        v: "鹤岗市",
        c: ["兴山区", "向阳区", "工农区", "南山区", "兴安区", "东山区", "萝北县", "绥滨县"]
    },
    {
        v: "双鸭山市",
        c: ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "友谊县", "宝清县", "饶河县"]
    },
    {
        v: "大庆市",
        c: ["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县", "杜尔伯特蒙古族自治县"]
    },
    {
        v: "伊春市",
        c: ["伊春区", "南岔", "友好", "西林区", "翠峦区", "新青区", "美溪区", "金山屯", "五营", "乌马河", "汤旺河", "带岭区", "乌伊岭", "红星区", "上甘岭", "铁力市", "嘉荫县"]
    },
    {
        v: "佳木斯市",
        c: ["前进区", "向阳区", "东风区", "郊区", "同江市", "富锦市", "桦南县", "桦川县", "汤原县", "抚远县"]
    },
    {
        v: "七台河市",
        c: ["桃山区", "新兴区", "茄子河区", "勃利县"]
    },
    {
        v: "牡丹江市",
        c: ["爱民区", "东安区", "阳明区", "西安区", "绥芬河市", "海林市", "宁安市", "穆棱市", "东宁县", "林口县"]
    },
    {
        v: "黑河市",
        c: ["爱辉区", "北安市", "五大连池市", "嫩江县", "逊克县", "孙吴县"]
    },
    {
        v: "绥化市",
        c: ["北林区", "安达市", "肇东市", "海伦市", "望奎县", "兰西县", "青冈县", "庆安县", "明水县", "绥棱县"]
    },
    {
        v: "大兴安岭地区",
        c: ["呼玛县", "塔河县", "漠河县", "加格达奇区", "松岭区", "新林区", "呼中区"]
    }]
},
{
    v: "江苏省",
    b: [{
        v: "南京市",
        c: ["玄武", "白下", "秦淮", "建邺", "鼓楼", "下关", "浦口", "栖霞", "雨花台", "江宁", "六合", "溧水", "高淳"]
    },
    {
        v: "无锡市",
        c: ["崇安", "南长", "北塘", "滨湖", "锡山", "惠山", "江阴", "宜兴"]
    },
    {
        v: "徐州市",
        c: ["云龙", "鼓楼", "九里", "贾汪", "泉山", "新沂", "邳州", "丰县", "沛县", "铜山", "睢宁", ]
    },
    {
        v: "常州市",
        c: ["钟楼", "天宁", "戚墅堰", "新北", "武进", "溧阳", "金坛", ]
    },
    {
        v: "苏州市",
        c: ["金阊", "沧浪", "平江", "虎丘", "吴中", "相城", "常熟", "张家港", "昆山", "吴江", "太仓", ]
    },
    {
        v: "南通市",
        c: ["崇川", "港闸", "启东", "如皋", "通州", "海门", "海安", "如东", ]
    },
    {
        v: "连云港",
        c: ["新浦", "连云", "海州", "赣榆", "东海", "灌云", "灌南", ]
    },
    {
        v: "淮安市",
        c: ["清河", "清浦", "楚州", "淮阴", "涟水", "洪泽", "盱眙", "金湖", ]
    },
    {
        v: "盐城市",
        c: ["亭湖", "盐都", "东台", "大丰", "响水", "滨海", "阜宁", "射阳", "建湖", ]
    },
    {
        v: "扬州市",
        c: ["广陵", "邗江", "维扬区", "仪征", "高邮", "江都", "宝应", ]
    },
    {
        v: "镇江市",
        c: ["京口", "润州", "丹徒", "丹阳", "扬中", "句容", ]
    },
    {
        v: "泰州市",
        c: ["海陵", "高港", "兴化", "靖江", "泰兴", "姜堰", ]
    },
    {
        v: "宿迁市",
        c: ["宿城", "宿豫", "沭阳", "泗阳", "泗洪", ]
    }]
},
{
    v: "浙江省",
    b: [{
        v: "杭州市",
        c: ["拱墅区", "上城区", "下城区", "江干区", "西湖区", "滨江区", "萧山区", "余杭区", "建德市", "富阳市", "临安市", "桐庐县", "淳安县", ]
    },
    {
        v: "宁波市",
        c: ["海曙区", "江东区", "江北区", "北仑区", "镇海区", "鄞州区", "余姚市", "慈溪市", "奉化市", "象山县", "宁海县", ]
    },
    {
        v: "温州市",
        c: ["鹿城区", "龙湾区", "瓯海区", "瑞安市", "乐清市", "洞头县", "永嘉县", "平阳县", "苍南县", "文成县", "泰顺县", ]
    },
    {
        v: "嘉兴市",
        c: ["南湖区", "秀洲区", "海宁市", "平湖市", "桐乡市", "嘉善县", "海盐县", ]
    },
    {
        v: "湖州市",
        c: ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县", ]
    },
    {
        v: "绍兴市",
        c: ["越城区", "诸暨市", "上虞市", "嵊州市", "绍兴县", "新昌县", ]
    },
    {
        v: "金华市",
        c: ["婺城区", "金东区", "兰溪市", "义乌市", "东阳市", "永康市", "武义县", "浦江县", "磐安县", ]
    },
    {
        v: "衢州市",
        c: ["柯城区", "衢江区", "江山市", "常山县", "开化县", "龙游县", ]
    },
    {
        v: "舟山市",
        c: ["定海区", "普陀区", "岱山县", "嵊泗县", ]
    },
    {
        v: "台州市",
        c: ["椒江区", "黄岩区", "路桥区", "温岭市", "临海市", "玉环县", "三门县", "天台县", "仙居县", ]
    },
    {
        v: "丽水市",
        c: ["莲都区", "龙泉市", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县", ]
    }]
},
{
    v: "安徽省",
    b: [{
        v: "合肥市",
        c: ["庐阳区", "瑶海区", "蜀山区", "包河区", "长丰县", "肥东县", "肥西县", ]
    },
    {
        v: "芜湖市",
        c: ["镜湖区", "弋江区", "鸠江区", "三山区", "芜湖县", "繁昌县", "南陵县", ]
    },
    {
        v: "蚌埠市",
        c: ["蚌山区", "龙子湖", "禹会区", "淮上区", "怀远县", "五河县", "固镇县", ]
    },
    {
        v: "淮南市",
        c: ["田家庵", "大通区", "谢家集", "八公山", "潘集区", "凤台县", ]
    },
    {
        v: "马鞍山市",
        c: ["雨山区", "金家庄", "花山区", "当涂县", ]
    },
    {
        v: "淮北市",
        c: ["相山区", "杜集区", "烈山区", "濉溪县", ]
    },
    {
        v: "铜陵市",
        c: ["铜官山", "狮子山", "郊区", "铜陵县", ]
    },
    {
        v: "安庆市",
        c: ["迎江区", "大观区", "宜秀区", "桐城市", "怀宁县", "枞阳县", "潜山县", "太湖县", "宿松县", "望江县", "岳西县", ]
    },
    {
        v: "黄山市",
        c: ["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县", ]
    },
    {
        v: "滁州市",
        c: ["琅琊区", "南谯区", "天长市", "明光市", "来安县", "全椒县", "定远县", "凤阳县", ]
    },
    {
        v: "阜阳市",
        c: ["颍州区", "颍东区", "颍泉区", "界首市", "临泉县", "太和县", "阜南县", "颍上县", ]
    },
    {
        v: "宿州市",
        c: ["埇桥区", "砀山县", "萧县", "灵璧县", "泗县", ]
    },
    {
        v: "巢湖市",
        c: ["居巢区", "庐江县", "无为县", "含山县", "和县", ]
    },
    {
        v: "六安市",
        c: ["金安区", "裕安区", "寿县", "霍邱县", "舒城县", "金寨县", "霍山县", ]
    },
    {
        v: "亳州市",
        c: ["谯城区", "涡阳县", "蒙城县", "利辛县", ]
    },
    {
        v: "池州市",
        c: ["贵池区", "东至县", "石台县", "青阳县", ]
    },
    {
        v: "宣城市",
        c: ["宣州区", "宁国市", "郎溪县", "广德县", "泾县", "绩溪县", "旌德县", ]
    }]
},
{
    v: "福建省",
    b: [{
        v: "福州市",
        c: ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "闽侯县", "连江县", "罗源县", "闽清县", "永泰县", "平潭县", "福清市", "长乐市", ]
    },
    {
        v: "厦门市",
        c: ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区", ]
    },
    {
        v: "莆田市",
        c: ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县", ]
    },
    {
        v: "三明市",
        c: ["梅列区", "三元区", "明溪县", "清流县", "宁化县", "大田县", "尤溪县", "沙", "县", "将乐县", "泰宁县", "建宁县", "永安市", ]
    },
    {
        v: "泉州市",
        c: ["鲤城区", "丰泽区", "洛江区", "泉港区", "惠安县", "安溪县", "永春县", "德化县", "金门县", "石狮市", "晋江市", "南安市", ]
    },
    {
        v: "漳州市",
        c: ["芗城区", "龙文区", "云霄县", "漳浦县", "诏安县", "长泰县", "东山县", "南靖县", "平和县", "华安县", "龙海市", ]
    },
    {
        v: "南平市",
        c: ["延平区", "顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "邵武市", "武夷山", "建瓯市", "建阳市", ]
    },
    {
        v: "龙岩市",
        c: ["新罗区", "长汀县", "永定县", "上杭县", "武平县", "连城县", "漳平市", ]
    },
    {
        v: "宁德市",
        c: ["蕉城区", "霞浦县", "古田县", "屏南县", "寿宁县", "周宁县", "柘荣县", "福安市", "福鼎市", ]
    }]
},
{
    v: "江西省",
    b: [{
        v: "南昌市",
        c: ["东湖区", "西湖区", "青云谱", "湾里区", "青山湖", "南昌县", "新建县", "安义县", "进贤县", ]
    },
    {
        v: "景德镇市",
        c: ["珠山区", "昌江区", "乐平市", "浮梁县", ]
    },
    {
        v: "萍乡市",
        c: ["安源区", "湘东区", "莲花县", "芦溪县", "上栗县", ]
    },
    {
        v: "九江市",
        c: ["浔阳区", "庐山区", "瑞昌市", "九江县", "武宁县", "修水县", "永修县", "德安县", "星子县", "都昌县", "湖口县", "彭泽县", ]
    },
    {
        v: "新余市",
        c: ["渝水区", "分宜县", ]
    },
    {
        v: "鹰潭市",
        c: ["月湖区", "贵溪市", "余江县", ]
    },
    {
        v: "赣州市",
        c: ["章贡区", "瑞金市", "南康市", "赣", "县", "信丰县", "大余县", "上犹县", "崇义县", "安远县", "龙南县", "定南县", "全南县", "宁都县", "于都县", "兴国县", "会昌县", "寻乌县", "石城县", ]
    },
    {
        v: "吉安市",
        c: ["吉州区", "青原区", "井冈山", "吉安县", "吉水县", "峡江县", "新干县", "永丰县", "泰和县", "遂川县", "万安县", "安福县", "永新县", ]
    },
    {
        v: "宜春市",
        c: ["袁州区", "丰城市", "樟树市", "高安市", "奉新县", "万载县", "上高县", "宜丰县", "靖安县", "铜鼓县", ]
    },
    {
        v: "抚州市",
        c: ["临川区", "南城县", "黎川县", "南丰县", "崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "东乡县", "广昌县", ]
    },
    {
        v: "上饶市",
        c: ["信州区", "德兴市", "上饶县", "广丰县", "玉山县", "铅山县", "横峰县", "弋阳县", "余干县", "鄱阳县", "万年县", "婺源县", ]
    }]
},
{
    v: "山东省",
    b: [{
        v: "济南市",
        c: ["历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "章丘市", "平阴县", "济阳县", "商河县", ]
    },
    {
        v: "青岛市",
        c: ["市南区", "市北区", "四方区", "黄岛区", "崂山区", "李沧区", "城阳区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市", ]
    },
    {
        v: "淄博市",
        c: ["张店区", "淄川区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县", ]
    },
    {
        v: "枣庄市",
        c: ["市中区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市", ]
    },
    {
        v: "东营市",
        c: ["东营区", "河口区", "垦利县", "利津县", "广饶县", ]
    },
    {
        v: "烟台市",
        c: ["芝罘区", "福山区", "牟平区", "莱山区", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "栖霞市", "海阳市", "长岛县", ]
    },
    {
        v: "潍坊市",
        c: ["潍城区", "寒亭区", "坊子区", "奎文区", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市", "临朐县", "昌乐县", ]
    },
    {
        v: "威海市",
        c: ["环翠区", "文登市", "荣成市", "乳山市", ]
    },
    {
        v: "济宁市",
        c: ["市中区", "任城区", "曲阜市", "兖州市", "邹城市", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", ]
    },
    {
        v: "泰安市",
        c: ["泰山区", "岱岳区", "新泰市", "肥城市", "宁阳县", "东平县", ]
    },
    {
        v: "日照市",
        c: ["东港区", "岚山区", "五莲县", "莒县", ]
    },
    {
        v: "莱芜市",
        c: ["莱城区", "钢城区", ]
    },
    {
        v: "临沂市",
        c: ["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "苍山县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县", ]
    },
    {
        v: "德州市",
        c: ["德城区", "乐陵市", "禹城市", "陵县", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", ]
    },
    {
        v: "聊城市",
        c: ["东昌府区", "临清市", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "高唐县", ]
    },
    {
        v: "滨州市",
        c: ["滨城区", "惠民县", "阳信县", "无棣县", "沾化县", "博兴县", "邹平县", ]
    },
    {
        v: "菏泽市",
        c: ["牡丹区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "定陶县", "东明县", ]
    }]
},
{
    v: "河南省",
    b: [{
        v: "郑州市",
        c: ["中原区", "二七区", "管城区", "金水区", "上街区", "惠济区", "巩义市", "荥阳市", "新密市", "新郑市", "登封市", "中牟县", ]
    },
    {
        v: "开封市",
        c: ["鼓楼区", "龙亭区", "顺河区", "禹王台", "金明区", "杞县", "通许县", "尉氏县", "开封县", "兰考县", ]
    },
    {
        v: "洛阳市",
        c: ["西工区", "老城区", "瀍河区", "涧西区", "吉利区", "洛龙区", "偃师市", "孟津县", "新安县", "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县", ]
    },
    {
        v: "平顶山市",
        c: ["新华区", "卫东区", "湛河区", "石龙区", "舞钢市", "汝州市", "宝丰县", "叶县", "鲁山县", "郏县", ]
    },
    {
        v: "焦作市",
        c: ["山阳区", "解放区", "中站区", "马村区", "沁阳市", "孟州市", "修武县", "博爱县", "武陟县", "温县", ]
    },
    {
        v: "鹤壁市",
        c: ["淇滨区", "山城区", "鹤山区", "浚县", "淇县", ]
    },
    {
        v: "新乡市",
        c: ["卫滨区", "红旗区", "凤泉区", "牧野区", "卫辉市", "辉县市", "新乡县", "获嘉县", "原阳县", "延津县", "封丘县", "长垣县", ]
    },
    {
        v: "安阳市",
        c: ["北关区", "文峰区", "殷都区", "龙安区", "林州市", "安阳县", "汤阴县", "滑", "县", "内黄县", ]
    },
    {
        v: "濮阳市",
        c: ["华龙区", "清丰县", "南乐县", "范", "县", "台前县", "濮阳县", ]
    },
    {
        v: "许昌市",
        c: ["魏都区", "禹州市", "长葛市", "许昌县", "鄢陵县", "襄城县", ]
    },
    {
        v: "漯河市",
        c: ["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县", ]
    },
    {
        v: "三门峡市",
        c: ["湖滨区", "义马市", "灵宝市", "渑池县", "陕县", "卢氏县", ]
    },
    {
        v: "南阳市",
        c: ["卧龙区", "宛城区", "邓州市", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县", "社旗县", "唐河县", "新野县", "桐柏县", ]
    },
    {
        v: "商丘市",
        c: ["梁园区", "睢阳区", "永城市", "民权县", "睢县", "宁陵县", "柘城县", "虞城县", "夏邑县", ]
    },
    {
        v: "信阳市",
        c: ["浉河区", "平桥区", "罗山县", "光山县", "新县", "商城县", "固始县", "潢川县", "淮滨县", "息县", ]
    },
    {
        v: "周口市",
        c: ["川汇区", "项城市", "扶沟县", "西华县", "商水县", "沈丘县", "郸城县", "淮阳县", "太康县", "鹿邑县", ]
    },
    {
        v: "驻马店市",
        c: ["驿城区", "西平县", "上蔡县", "平舆县", "正阳县", "确山县", "泌阳县", "汝南县", "遂平县", "新蔡县", ]
    },
    {
        v: "济源市",
        c: []
    }]
},
{
    v: "湖北省",
    b: [{
        v: "武汉市",
        c: ["江岸", "江汉", "硚口", "汉阳", "武昌", "青山", "洪山", "东西湖", "汉南", "蔡甸", "江夏", "黄陂", "新洲", ]
    },
    {
        v: "黄石市",
        c: ["黄石港", "西塞山", "下陆", "铁山", "大冶", "阳新", ]
    },
    {
        v: "襄樊市",
        c: ["襄城", "樊城", "襄阳", "老河口", "枣阳", "宜城", "南漳", "谷城", "保康", ]
    },
    {
        v: "十堰市",
        c: ["茅箭", "张湾", "丹江口", "郧县", "郧西", "竹山", "竹溪", "房县", ]
    },
    {
        v: "荆州市",
        c: ["沙市", "荆州", "石首", "洪湖", "松滋", "公安", "监利", "江陵", ]
    },
    {
        v: "宜昌市",
        c: ["西陵", "伍家岗", "点军", "猇亭", "夷陵", "宜都", "当阳", "枝江", "远安", "兴山", "秭归", "长阳", "五峰", ]
    },
    {
        v: "荆门市",
        c: ["东宝", "掇刀", "钟祥", "京山", "沙洋", ]
    },
    {
        v: "鄂州市",
        c: ["鄂城", "梁子湖", "华容", ]
    },
    {
        v: "孝感市",
        c: ["孝南", "应城", "安陆", "汉川", "孝昌", "大悟", "云梦", ]
    },
    {
        v: "黄冈市",
        c: ["黄州", "麻城", "武穴", "团风", "红安", "罗田", "英山", "浠水", "蕲春", "黄梅", ]
    },
    {
        v: "咸宁市",
        c: ["咸安", "赤壁", "嘉鱼", "通城", "崇阳", "通山", ]
    },
    {
        v: "随州市",
        c: ["曾都", "广水", ]
    },
    {
        v: "恩施州",
        c: ["恩施", "利川", "建始", "巴东", "宣恩", "咸丰", "来凤", "鹤峰", ]
    },
    {
        v: "仙桃",
        c: []
    },
    {
        v: "潜江",
        c: []
    },
    {
        v: "天门",
        c: []
    },
    {
        v: "神农架",
        c: []
    }]
},
{
    v: "湖南省",
    b: [{
        v: "长沙市",
        c: ["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "浏阳市", "长沙县", "望城县", "宁乡县", ]
    },
    {
        v: "株洲市",
        c: ["荷塘区", "芦淞区", "石峰区", "天元区", "醴陵市", "株洲县", "攸县", "茶陵县", "炎陵县", ]
    },
    {
        v: "湘潭市",
        c: ["雨湖区", "岳塘区", "湘乡市", "韶山市", "湘潭县", ]
    },
    {
        v: "衡阳市",
        c: ["珠晖区", "雁峰区", "石鼓区", "蒸湘区", "南岳区", "耒阳市", "常宁市", "衡阳县", "衡南县", "衡山县", "衡东县", "祁东县", ]
    },
    {
        v: "邵阳市",
        c: ["双清区", "大祥区", "北塔区", "武冈市", "邵东县", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步自治县", ]
    },
    {
        v: "岳阳市",
        c: ["岳阳楼", "云溪区", "君山区", "汨罗市", "临湘市", "岳阳县", "华容县", "湘阴县", "平江县", ]
    },
    {
        v: "常德市",
        c: ["武陵区", "鼎城区", "津市市", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县", ]
    },
    {
        v: "张家界市",
        c: ["永定区", "武陵源", "慈利县", "桑植县", ]
    },
    {
        v: "益阳市",
        c: ["资阳区", "赫山区", "沅江市", "南", "县", "桃江县", "安化县", ]
    },
    {
        v: "郴州市",
        c: ["北湖区", "苏仙区", "资兴市", "桂阳县", "宜章县", "永兴县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县", ]
    },
    {
        v: "永州市",
        c: ["零陵区", "冷水滩", "祁阳县", "东安县", "双牌县", "道县", "江永县", "宁远县", "蓝山县", "新田县", "江华自治县", ]
    },
    {
        v: "怀化市",
        c: ["鹤城区", "洪江市", "沅陵县", "辰溪县", "溆浦县", "中方县", "会同县", "麻阳自治县", "新晃自治县", "芷江自治县", "靖州自治县", "通道自治县", ]
    },
    {
        v: "娄底市",
        c: ["娄星区", "冷水江", "涟源市", "双峰县", "新化县", ]
    },
    {
        v: "湘西州",
        c: ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县", ]
    }]
},
{
    v: "广东省",
    b: [{
        v: "广州市",
        c: ["越秀区", "荔湾区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "萝岗区", "增城市", "从化市", ]
    },
    {
        v: "深圳市",
        c: ["福田区", "罗湖区", "南山区", "宝安区", "龙岗区", "盐田区", ]
    },
    {
        v: "珠海市",
        c: ["香洲区", "斗门区", "金湾区", ]
    },
    {
        v: "汕头市",
        c: ["金平区", "龙湖区", "濠江区", "潮阳区", "潮南区", "澄海区", "南澳县", ]
    },
    {
        v: "韶关市",
        c: ["浈江区", "武江区", "曲江区", "乐昌市", "南雄市", "始兴县", "仁化县", "翁源县", "新丰县", "乳源瑶族自治县", ]
    },
    {
        v: "佛山市",
        c: ["禅城区", "南海区", "顺德区", "三水区", "高明区", ]
    },
    {
        v: "江门市",
        c: ["江海区", "蓬江区", "新会区", "台山市", "开平市", "鹤山市", "恩平市", ]
    },
    {
        v: "湛江市",
        c: ["赤坎区", "霞山区", "坡头区", "麻章区", "廉江市", "雷州市", "吴川市", "遂溪县", "徐闻县", ]
    },
    {
        v: "茂名市",
        c: ["茂南区", "茂港区", "高州市", "化州市", "信宜市", "电白县", ]
    },
    {
        v: "肇庆市",
        c: ["端州区", "鼎湖区", "高要市", "四会市", "广宁县", "怀集县", "封开县", "德庆县", ]
    },
    {
        v: "惠州市",
        c: ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县", ]
    },
    {
        v: "梅州市",
        c: ["梅江区", "兴宁市", "梅", "县", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", ]
    },
    {
        v: "汕尾市",
        c: ["城", "区", "陆丰市", "海丰县", "陆河县", ]
    },
    {
        v: "河源市",
        c: ["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县", ]
    },
    {
        v: "阳江市",
        c: ["江城区", "阳春市", "阳西县", "阳东县", ]
    },
    {
        v: "清远市",
        c: ["清城区", "英德市", "连州市", "佛冈县", "阳山县", "清新县", "连山壮族瑶族自治县", "连南瑶族自治县", ]
    },
    {
        v: "东莞市",
        c: []
    },
    {
        v: "中山市",
        c: []
    },
    {
        v: "潮州市",
        c: ["湘桥区", "潮安县", "饶平县", ]
    },
    {
        v: "揭阳市",
        c: ["榕城区", "普宁市", "揭东县", "揭西县", "惠来县", ]
    },
    {
        v: "云浮市",
        c: ["云城区", "罗定市", "新兴县", "郁南县", "云安县", ]
    }]
},
{
    v: "广西壮族自治区",
    b: [{
        v: "南宁市",
        c: ["兴宁区", "青秀区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣县", "隆安县", "马山县", "上林县", "宾阳县", "横县", ]
    },
    {
        v: "柳州市",
        c: ["城中区", "鱼峰区", "柳南区", "柳北区", "柳江县", "柳城县", "鹿寨县", "融安县", "融水苗族自治县", "三江侗族自治县", ]
    },
    {
        v: "桂林市",
        c: ["秀峰区", "叠彩区", "象山区", "七星区", "雁山区", "阳朔县", "临桂县", "灵川县", "全州县", "兴安县", "永福县", "灌阳县", "资源县", "平乐县", "荔浦县", "龙胜各族自治县", "恭城瑶族自治县", ]
    },
    {
        v: "梧州市",
        c: ["万秀区", "蝶山区", "长洲区", "岑溪市", "苍梧县", "藤县", "蒙山县", ]
    },
    {
        v: "北海市",
        c: ["海城区", "银海区", "铁山港区", "合浦县", ]
    },
    {
        v: "防城港市",
        c: ["港口区", "防城区", "东兴市", "上思县", ]
    },
    {
        v: "钦州市",
        c: ["钦南区", "钦北区", "灵山县", "浦北县", ]
    },
    {
        v: "贵港市",
        c: ["港北区", "港南区", "覃塘区", "桂平市", "平南县", ]
    },
    {
        v: "玉林市",
        c: ["玉州区", "北流市", "容县", "陆川县", "博白县", "兴业县", ]
    },
    {
        v: "百色市",
        c: ["右江区", "田阳县", "田东县", "平果县", "德保县", "靖西县", "那坡县", "凌云县", "乐业县", "田林县", "西林县", "隆林各族自治县", ]
    },
    {
        v: "贺州市",
        c: ["八步区", "昭平县", "钟山县", "富川瑶族自治县", ]
    },
    {
        v: "河池市",
        c: ["金城江区", "宜州市", "南丹县", "天峨县", "凤山县", "东兰县", "罗城仫佬族自治县", "环江毛南族自治县", "巴马瑶族自治县", "都安瑶族自治县", "大化瑶族自治县", ]
    },
    {
        v: "来宾市",
        c: ["兴宾区", "合山市", "忻城县", "象州县", "武宣县", "金秀瑶族自治县", ]
    },
    {
        v: "崇左市",
        c: ["江州区", "凭祥市", "扶绥县", "宁明县", "龙州县", "大新县", "天等县", ]
    }]
},
{
    v: "海南省",
    b: [{
        v: "海口市",
        c: ["龙华区", "秀英区", "琼山区", "美兰区", ]
    },
    {
        v: "三亚市",
        c: []
    },
    {
        v: "文昌市",
        c: []
    },
    {
        v: "琼海市",
        c: []
    },
    {
        v: "万宁市",
        c: []
    },
    {
        v: "五指山市",
        c: []
    },
    {
        v: "东方市",
        c: []
    },
    {
        v: "儋州市",
        c: []
    },
    {
        v: "临高县",
        c: []
    },
    {
        v: "澄迈县",
        c: []
    },
    {
        v: "定安县",
        c: []
    },
    {
        v: "屯昌县",
        c: []
    },
    {
        v: "昌江黎族自治县",
        c: []
    },
    {
        v: "白沙黎族自治县",
        c: []
    },
    {
        v: "琼中黎族苗族自治县",
        c: []
    },
    {
        v: "陵水黎族自治县",
        c: []
    },
    {
        v: "保亭黎族苗族自治县",
        c: []
    },
    {
        v: "乐东黎族自治县",
        c: []
    },
    {
        v: "西南中沙群岛",
        c: []
    }]
},
{
    v: "四川省",
    b: [{
        v: "成都市",
        c: ["锦江", "青羊", "金牛", "武侯", "成华", "龙泉驿", "青白江", "新都", "温江区", "都江堰", "彭州", "邛崃", "崇州市", "金堂", "双流", "郫县", "大邑", "蒲江", "新津县", ]
    },
    {
        v: "自贡市",
        c: ["自流井", "贡井区", "大安区", "沿滩区", "荣县", "富顺县", ]
    },
    {
        v: "攀枝花市",
        c: ["东区", "西区", "仁和区", "米易县", "盐边县", ]
    },
    {
        v: "泸州市",
        c: ["江阳区", "纳溪区", "龙马潭", "泸", "县", "合江县", "叙永县", "古蔺县", ]
    },
    {
        v: "德阳市",
        c: ["旌阳区", "广汉市", "什邡市", "绵竹市", "罗江县", "中江县", ]
    },
    {
        v: "绵阳市",
        c: ["涪城区", "游仙区", "江油市", "三台县", "盐亭县", "安县", "梓潼县", "平武县", "北川羌族自治县", ]
    },
    {
        v: "广元市",
        c: ["利州区", "元坝区", "朝天区", "旺苍县", "青川县", "剑阁县", "苍溪县", ]
    },
    {
        v: "遂宁市",
        c: ["船山区", "安居区", "蓬溪县", "射洪县", "大英县", ]
    },
    {
        v: "内江市",
        c: ["市中区", "东兴区", "威远县", "资中县", "隆昌县", ]
    },
    {
        v: "乐山市",
        c: ["市中区", "沙湾区", "五通桥", "金口河", "峨眉山", "犍为县", "井研县", "夹江县", "沐川县", "峨边彝族自治县", "马边彝族自治县", ]
    },
    {
        v: "南充市",
        c: ["顺庆区", "高坪区", "嘉陵区", "阆中市", "南部县", "营山县", "蓬安县", "仪陇县", "西充县", ]
    },
    {
        v: "宜宾市",
        c: ["翠屏区", "宜宾县", "南溪县", "江安县", "长宁县", "高", "县", "珙", "县", "筠连县", "兴文县", "屏山县", ]
    },
    {
        v: "广安市",
        c: ["广安区", "华蓥市", "岳池县", "武胜县", "邻水县", ]
    },
    {
        v: "达州市",
        c: ["通川区", "万源市", "达县", "宣汉县", "开江县", "大竹县", "渠县", ]
    },
    {
        v: "眉山市",
        c: ["东坡区", "仁寿县", "彭山县", "洪雅县", "丹棱县", "青神县", ]
    },
    {
        v: "雅安市",
        c: ["雨城区", "名山县", "荥经县", "汉源县", "石棉县", "天全县", "芦山县", "宝兴县", ]
    },
    {
        v: "巴中市",
        c: ["巴州区", "通江县", "南江县", "平昌县", ]
    },
    {
        v: "资阳市",
        c: ["雁江区", "简阳市", "安岳县", "乐至县", ]
    },
    {
        v: "阿坝州",
        c: ["马尔康", "汶川县", "理县", "茂县", "松潘县", "九寨沟县", "金川县", "小金县", "黑水县", "壤塘县", "阿坝县", "若尔盖县", "红原县", ]
    },
    {
        v: "甘孜州",
        c: ["康定县", "泸定县", "丹巴", "九龙", "雅江", "道孚", "炉霍", "甘孜", "新龙", "德格", "白玉", "石渠", "色达", "理塘", "巴塘", "乡城", "稻城", "得荣", ]
    },
    {
        v: "凉山州",
        c: ["西昌市", "盐源县", "德昌县", "会理县", "会东", "宁南", "普格", "布拖", "金阳", "昭觉", "喜德", "冕宁", "越西", "甘洛", "美姑", "雷波", "木里自治县", ]
    }]
},
{
    v: "贵州省",
    b: [{
        v: "贵阳市",
        c: ["乌当区", "南明区", "云岩区", "花溪区", "白云区", "小河区", "清镇市", "开阳县", "息烽县", "修文县", ]
    },
    {
        v: "六盘水市",
        c: ["钟山区", "六枝特区", "水城县", "盘县", ]
    },
    {
        v: "遵义市",
        c: ["红花岗区", "汇川区", "赤水市", "仁怀市", "遵义县", "桐梓县", "绥阳县", "正安县", "凤冈县", "湄潭县", "余庆县", "习水县", "道真仡佬族苗族自治县", "务川仡佬族苗族自治县", ]
    },
    {
        v: "安顺市",
        c: ["西秀区", "平坝县", "普定县", "镇宁布依族苗族自治县", "关岭布依族苗族自治县", "紫云苗族布依族自治县", ]
    },
    {
        v: "铜仁地区",
        c: ["铜仁市", "江口县", "石阡县", "思南县", "德江县", "玉屏侗族自治县", "印江土家族苗族自治县", "沿河土家族自治县", "松桃苗族自治县", "万山特区", ]
    },
    {
        v: "毕节地区",
        c: ["毕节市", "大方县", "黔西县", "金沙县", "织金县", "纳雍县", "赫章县", "威宁彝族回族苗族自治县", ]
    },
    {
        v: "黔西南州",
        c: ["兴义市", "兴仁县", "普安县", "晴隆县", "贞丰县", "望谟县", "册亨县", "安龙县", ]
    },
    {
        v: "黔东南州",
        c: ["凯里市", "黄平县", "施秉县", "三穗县", "镇远县", "岑巩县", "天柱县", "锦屏县", "剑河县", "台江县", "黎平县", "榕江县", "从江县", "雷山县", "麻江县", "丹寨县", ]
    },
    {
        v: "黔南州",
        c: ["都匀市", "福泉市", "荔波县", "贵定县", "瓮安县", "独山县", "平塘县", "罗甸县", "长顺县", "龙里县", "惠水县", "三都水族自治县", ]
    }]
},
{
    v: "云南省",
    b: [{
        v: "昆明市",
        c: ["五华区", "盘龙区", "官渡区", "西山区", "东川区", "安宁市", "呈贡县", "晋宁县", "富民县", "宜良县", "嵩明县", "石林县", "禄劝县", "寻甸县", ]
    },
    {
        v: "曲靖市",
        c: ["麒麟区", "宣威市", "马龙县", "陆良县", "师宗县", "罗平县", "富源县", "会泽县", "沾益县", ]
    },
    {
        v: "玉溪市",
        c: ["红塔区", "江川县", "澄江县", "通海县", "华宁县", "易门县", "峨山县", "新平县", "元江县", ]
    },
    {
        v: "保山市",
        c: ["隆阳区", "施甸县", "腾冲县", "龙陵县", "昌宁县", ]
    },
    {
        v: "昭通市",
        c: ["昭阳区", "鲁甸县", "巧家县", "盐津县", "大关县", "永善县", "绥江县", "镇雄县", "彝良县", "威信县", "水富县", ]
    },
    {
        v: "丽江市",
        c: ["古城区", "永胜县", "华坪县", "玉龙县", "宁蒗县", ]
    },
    {
        v: "普洱市",
        c: ["思茅区", "宁洱县", "墨江县", "景东县", "景谷县", "镇沅县", "江城县", "孟连县", "澜沧县", "西盟县", ]
    },
    {
        v: "临沧市",
        c: ["临翔区", "凤庆县", "云", "县", "永德县", "镇康县", "双江县", "耿马县", "沧源县", ]
    },
    {
        v: "文山州",
        c: ["文山县", "砚山县", "西畴县", "麻栗坡", "马关县", "丘北县", "广南县", "富宁县", ]
    },
    {
        v: "红河州",
        c: ["蒙自县", "个旧市", "开远市", "绿春县", "建水县", "石屏县", "弥勒县", "泸西县", "元阳县", "红河县", "金平县", "河口县", "屏边县", ]
    },
    {
        v: "西双版纳州",
        c: ["景洪市", "勐海县", "勐腊县", ]
    },
    {
        v: "楚雄州",
        c: ["楚雄市", "双柏县", "牟定县", "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县", "禄丰县", ]
    },
    {
        v: "大理州",
        c: ["大理市", "祥云县", "宾川县", "弥渡县", "永平县", "云龙县", "洱源县", "剑川县", "鹤庆县", "漾濞县", "南涧县", "巍山县", ]
    },
    {
        v: "德宏州",
        c: ["潞西市", "瑞丽市", "梁河县", "盈江县", "陇川县", ]
    },
    {
        v: "怒江州",
        c: ["泸水县", "福贡县", "贡山县", "兰坪县", ]
    },
    {
        v: "迪庆州",
        c: ["香格里拉县", "德钦县", "维西县", ]
    }]
},
{
    v: "西藏自治区",
    b: [{
        v: "拉萨市",
        c: ["城关区", "林周县", "当雄县", "尼木县", "曲水县", "堆龙德庆县", "达孜县", "墨竹工卡县", ]
    },
    {
        v: "昌都地区",
        c: ["昌都县", "江达县", "贡觉县", "类乌齐县", "丁青县", "察雅县", "八宿县", "左贡县", "芒康县", "洛隆县", "边坝县", ]
    },
    {
        v: "山南地区",
        c: ["乃东县", "扎囊县", "贡嘎县", "桑日县", "琼结县", "曲松县", "措美县", "洛扎县", "加查县", "隆子县", "错那县", "浪卡子县", ]
    },
    {
        v: "日喀则地区",
        c: ["日喀则市", "南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县", "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县", ]
    },
    {
        v: "那曲地区",
        c: ["那曲县", "嘉黎县", "比如县", "聂荣县", "安多县", "申扎县", "索县", "班戈县", "巴青县", "尼玛县", "双湖特别区", ]
    },
    {
        v: "阿里地区",
        c: ["噶尔县", "普兰县", "札达县", "日土县", "革吉县", "改则县", "措勤县", ]
    },
    {
        v: "林芝地区",
        c: ["林芝县", "工布江达县", "米林县", "墨脱县", "波密县", "察隅县", "朗县", ]
    }]
},
{
    v: "陕西省",
    b: [{
        v: "西安市",
        c: ["未央区", "新城区", "碑林区", "莲湖区", "灞桥区", "雁塔区", "阎良区", "临潼区", "长安区", "蓝田县", "周至县", "户县", "高陵县", ]
    },
    {
        v: "铜川市",
        c: ["耀州区", "王益区", "印台区", "宜君县", ]
    },
    {
        v: "宝鸡市",
        c: ["渭滨区", "金台区", "陈仓区", "凤翔县", "岐山县", "扶风县", "眉县", "陇县", "千阳县", "麟游县", "凤县", "太白县", ]
    },
    {
        v: "咸阳市",
        c: ["秦都区", "杨陵区", "渭城区", "兴平市", "三原县", "泾阳县", "乾县", "礼泉县", "永寿县", "彬县", "长武县", "旬邑县", "淳化县", "武功县", ]
    },
    {
        v: "渭南市",
        c: ["临渭区", "韩城市", "华阴市", "华县", "潼关县", "大荔县", "合阳县", "澄城县", "蒲城县", "白水县", "富平县", ]
    },
    {
        v: "延安市",
        c: ["宝塔区", "延长县", "延川县", "子长县", "安塞县", "志丹县", "吴起县", "甘泉县", "富县", "洛川县", "宜川县", "黄龙县", "黄陵县", ]
    },
    {
        v: "汉中市",
        c: ["汉台区", "南郑县", "城固县", "洋县", "西乡县", "勉县", "宁强县", "略阳县", "镇巴县", "留坝县", "佛坪县", ]
    },
    {
        v: "榆林市",
        c: ["榆阳区", "神木县", "府谷县", "横山县", "靖边县", "定边县", "绥德县", "米脂县", "佳县", "吴堡县", "清涧县", "子洲县", ]
    },
    {
        v: "安康市",
        c: ["汉滨区", "汉阴县", "石泉县", "宁陕县", "紫阳县", "岚皋县", "平利县", "镇坪县", "旬阳县", "白河县", ]
    },
    {
        v: "商洛市",
        c: ["商州区", "洛南县", "丹凤县", "商南县", "山阳县", "镇安县", "柞水县", ]
    }]
},
{
    v: "甘肃省",
    b: [{
        v: "兰州市",
        c: ["城关区", "七里河", "西固区", "安宁区", "红古区", "永登县", "皋兰县", "榆中县", ]
    },
    {
        v: "嘉峪关市",
        c: []
    },
    {
        v: "金昌市",
        c: ["金川区", "永昌县", ]
    },
    {
        v: "白银市",
        c: ["白银区", "平川区", "靖远县", "会宁县", "景泰县", ]
    },
    {
        v: "天水市",
        c: ["秦州区", "麦积区", "清水县", "秦安县", "甘谷县", "武山县", "张家川回族自治县", ]
    },
    {
        v: "武威市",
        c: ["凉州区", "民勤县", "古浪县", "天祝藏族自治县", ]
    },
    {
        v: "张掖市",
        c: ["甘州区", "民乐县", "临泽县", "高台县", "山丹县", "肃南裕固族自治县", ]
    },
    {
        v: "平凉市",
        c: ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭县", "庄浪县", "静宁县", ]
    },
    {
        v: "酒泉市",
        c: ["肃州区", "玉门市", "敦煌市", "金塔县", "瓜州县", "肃北蒙古族自治县", "阿克塞哈萨克族自治县", ]
    },
    {
        v: "庆阳市",
        c: ["西峰区", "庆城县", "环", "县", "华池县", "合水县", "正宁县", "宁县", "镇原县", ]
    },
    {
        v: "定西市",
        c: ["安定区", "通渭县", "陇西县", "渭源县", "临洮县", "漳县", "岷县", ]
    },
    {
        v: "陇南市",
        c: ["武都区", "成", "县", "文", "县", "宕昌县", "康", "县", "西和县", "礼县", "徽县", "两当县", ]
    },
    {
        v: "临夏州",
        c: ["临夏市", "临夏县", "康乐县", "永靖县", "广河县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县", ]
    },
    {
        v: "甘南州",
        c: ["合作市", "临潭县", "卓尼县", "舟曲县", "迭部县", "玛曲县", "碌曲县", "夏河县", ]
    }]
},
{
    v: "青海省",
    b: [{
        v: "西宁市",
        c: ["城东区", "城中区", "城西区", "城北区", "湟中县", "湟源县", "大通回族土族自治县", ]
    },
    {
        v: "海东地区",
        c: ["平安县", "乐都县", "民和回族土族自治县", "互助土族自治县", "化隆回族自治县", "循化撒拉族自治县", ]
    },
    {
        v: "海",
        c: ["北", "州", "海晏县", "祁连县", "刚察县", "门源回族自治县", ]
    },
    {
        v: "黄",
        c: ["南", "州", "同仁县", "尖扎县", "泽库县", "河南蒙古族自治县", ]
    },
    {
        v: "海",
        c: ["南", "州", "共和县", "同德县", "贵德县", "兴海县", "贵南县", ]
    },
    {
        v: "果",
        c: ["洛", "州", "玛沁县", "班玛县", "甘德县", "达日县", "久治县", "玛多县", ]
    },
    {
        v: "玉",
        c: ["树", "州", "玉树县", "杂多县", "称多县", "治多县", "囊谦县", "曲麻莱县", ]
    },
    {
        v: "海",
        c: ["西", "州", "德令哈市", "格尔木市", "乌兰县", "都兰县", "天峻县", "冷湖行委", "大柴旦行委", "茫崖行委", ]
    }]
},
{
    v: "宁夏回族自治区",
    b: [{
        v: "银川市",
        c: ["兴庆区", "金凤区", "西夏区", "永宁县", "贺兰县", "灵武市", ]
    },
    {
        v: "石嘴山市",
        c: ["大武口区", "惠农区", "平罗县", ]
    },
    {
        v: "吴忠市",
        c: ["利通区", "盐池县", "同心县", "青铜峡市", ]
    },
    {
        v: "固原市",
        c: ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县", ]
    },
    {
        v: "中卫市",
        c: ["沙坡头区", "中宁县", "海原县", ]
    }]
},
{
    v: "新疆维吾尔自治区",
    b: [{
        v: "乌鲁木齐市",
        c: ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "米东区", "乌鲁木齐县", ]
    },
    {
        v: "克拉玛依市",
        c: ["克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区", ]
    },
    {
        v: "吐鲁番地区",
        c: ["吐鲁番市", "鄯善县", "托克逊县", ]
    },
    {
        v: "哈密地区",
        c: ["哈密市", "伊吾县", "巴里坤哈萨克自治县", ]
    },
    {
        v: "和田地区",
        c: ["和田市", "和田县", "墨玉县", "皮山县", "洛浦县", "策勒县", "于田县", "民丰县", ]
    },
    {
        v: "阿克苏地区",
        c: ["阿克苏市", "温宿县", "库车县", "沙雅县", "新和县", "拜城县", "乌什县", "阿瓦提县", "柯坪县", ]
    },
    {
        v: "喀什地区",
        c: ["喀什市", "疏附县", "疏勒县", "英吉沙县", "泽普", "莎车", "叶城", "麦盖提", "岳普湖", "伽师", "巴楚", "塔什库尔干塔吉克自治县"]
    },
    {
        v: "克孜勒苏柯尔克孜自治州：阿图什市",
        c: ["阿克陶县", "阿合奇县", "乌恰县", ]
    },
    {
        v: "巴音郭楞蒙古自治州",
        c: ["库尔勒市", "轮台县", "尉犁县", "若羌县", "且末县", "焉耆回族自治县", "和静县", "和硕县", "博湖县", ]
    },
    {
        v: "昌吉回族自治州",
        c: ["昌吉市", "阜康市", "呼图壁县", "玛纳斯县", "奇台县", "吉木萨尔县", "木垒哈萨克自治县"]
    },
    {
        v: "博尔塔拉蒙古自治州",
        c: ["博乐市", "精河县", "温泉县"]
    },
    {
        v: "伊犁哈萨克自治州",
        c: ["伊宁市", "奎屯市", "伊宁县", "霍城县", "巩留县", "新源县", "昭苏县", "特克斯县", "尼勒克县", "察布查尔锡伯自治县"]
    },
    {
        v: "塔城地区",
        c: ["塔城市", "乌苏市", "额敏县", "沙湾县", "托里县", "裕民县", "和布克赛尔蒙古自治县"]
    },
    {
        v: "阿勒泰地区",
        c: ["阿勒泰市", "布尔津县", "富蕴县", "福海县", "哈巴河县", "青河县", "吉木乃县"]
    },
    {
        v: "石河子市"
    },
    {
        v: "阿拉尔市"
    },
    {
        v: "图木舒克市"
    },
    {
        v: "五家渠市"
    }
    ]
},
{
    v: "台湾省",
    b: [{
        v: "台北市"
    },
    {
        v: "高雄市"
    },
    {
        v: "基隆市"
    },
    {
        v: "台中市"
    },
    {
        v: "台南市"
    },
    {
        v: "新竹市"
    },
    {
        v: "嘉义市"
    },
    {
        v: "台北县"
    },
    {
        v: "宜兰县"
    },
    {
        v: "桃园县"
    },
    {
        v: "新竹县"
    },
    {
        v: "苗栗县"
    },
    {
        v: "台中县"
    },
    {
        v: "彰化县"
    },
    {
        v: "南投县"
    },
    {
        v: "云林县"
    },
    {
        v: "嘉义县"
    },
    {
        v: "台南县"
    },
    {
        v: "高雄县"
    },
    {
        v: "屏东县"
    },
    {
        v: "台东县"
    },
    {
        v: "花莲县"
    },
    {
        v: "澎湖县"
    }]
},
 {
     v: "香港特别行政区",
     b: [{
         v: "中西区"
     },
     {
         v: "东区"
     },
     {
         v: "九龙城区"
     },
     {
         v: "观塘区"
     },
     {
         v: "南区"
     },
     {
         v: "深水埗区"
     },
     {
         v: "黄大仙区"
     },
     {
         v: "湾仔区"
     },
     {
         v: "油尖旺区"
     },
     {
         v: "离岛区"
     },
     {
         v: "葵青区"
     },
     {
         v: "北区"
     },
     {
         v: "西贡区"
     },
     {
         v: "沙田区"
     },
     {
         v: "屯门区"
     },
     {
         v: "大埔区"
     },
     {
         v: "荃湾区"
     },
     {
         v: "元朗区"
     },
     ]
 },
{
    v: "澳门特别行政区",
    b: [{
        v: "澳门半岛"
    },
    {
        v: "离岛"
    }]
},
 {
     v: "海外",
 }
]